Ran Plan for project: `frontend` dir: `frontend` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_address.static[0] must be replaced
-/+ resource "google_compute_address" "static" {
      ~ address            = "35.230.66.98" -> (known after apply)
        address_type       = "EXTERNAL"
      ~ creation_timestamp = "2020-09-19T12:32:23.555-07:00" -> (known after apply)
      ~ id                 = "projects/2036174436/regions/us-west1/addresses/dm-frontend-08aee1323848f94e7" -> (known after apply)
      ~ name               = "dm-frontend-08aee1323848f94e7" -> "dmlc-frontend-08aee1323848f94e7" # forces replacement
      ~ network_tier       = "PREMIUM" -> (known after apply)
      ~ project            = "2036174436" -> (known after apply)
      + purpose            = (known after apply)
      ~ region             = "us-west1" -> (known after apply)
      ~ self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-west1/addresses/dm-frontend-08aee1323848f94e7" -> (known after apply)
      + subnetwork         = (known after apply)
      ~ users              = [
          - "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west1-a/instances/dmlc-frontend-08aee1323848f94e7",
        ] -> (known after apply)
    }

  # google_compute_address.static[1] will be created
+ resource "google_compute_address" "static" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "dmlc-frontend-18aee1323848f94e7"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = (known after apply)
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_instance.frontend[0] will be updated in-place
~ resource "google_compute_instance" "frontend" {
        can_ip_forward          = false
        cpu_platform            = "Intel Broadwell"
        current_status          = "RUNNING"
        deletion_protection     = false
        enable_display          = false
        guest_accelerator       = []
        id                      = "projects/2036174436/zones/us-west1-a/instances/dmlc-frontend-08aee1323848f94e7"
        instance_id             = "2630059475407200058"
        label_fingerprint       = "42WmSpB8rSM="
        labels                  = {}
        machine_type            = "f1-micro"
        metadata                = {
            "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
        metadata_fingerprint    = "vuUXpj8-DnE="
        metadata_startup_script = <<~EOT
            sudo apt-get update;
            rm -rf /etc/motd
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip;
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`;
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sleep 3
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10;
            echo "sleep 10" >> /tmp/meio;
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            echo "instalou?" >> /tmp/meio;
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
            server = seed.dmlc.pw
            EOF
            cat >>
            cp /puppet.conf /etc/puppet/puppet.conf
            sudo service stop puppet
            echo "*/5 * * * * root puppet agent -t" >> /etc/crontab
        EOT
        name                    = "dmlc-frontend-08aee1323848f94e7"
        project                 = "2036174436"
        resource_policies       = []
        self_link               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west1-a/instances/dmlc-frontend-08aee1323848f94e7"
        tags                    = []
        tags_fingerprint        = "42WmSpB8rSM="
        zone                    = "us-west1-a"

        boot_disk {
            auto_delete = true
            device_name = "persistent-disk-0"
            mode        = "READ_WRITE"
            source      = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west1-a/disks/dmlc-frontend-08aee1323848f94e7"

            initialize_params {
                image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20200910"
                labels = {}
                size   = 10
                type   = "pd-standard"
            }
        }

      ~ network_interface {
            name               = "nic0"
            network            = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/networks/default"
            network_ip         = "10.138.0.48"
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-west1/subnetworks/default"
            subnetwork_project = "heroic-muse-289316"

          ~ access_config {
              ~ nat_ip       = "35.230.66.98" -> (known after apply)
                network_tier = "PREMIUM"
            }
        }

        scheduling {
            automatic_restart   = true
            on_host_maintenance = "MIGRATE"
            preemptible         = false
        }
    }

  # google_compute_instance.frontend[1] will be created
+ resource "google_compute_instance" "frontend" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "f1-micro"
      + metadata                = {
          + "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<~EOT
            sudo apt-get update;
            rm -rf /etc/motd
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip;
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`;
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sleep 3
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10;
            echo "sleep 10" >> /tmp/meio;
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            echo "instalou?" >> /tmp/meio;
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
            server = seed.dmlc.pw
            EOF
            cat >>
            cp /puppet.conf /etc/puppet/puppet.conf
            sudo service stop puppet
            echo "*/5 * * * * root puppet agent -t" >> /etc/crontab
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "dmlc-frontend-18aee1323848f94e7"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = "us-west1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 3 to add, 1 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
